{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v2.4.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "wpod_net_simple",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 224, 224, 3],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [2, 2],
              "padding": "same",
              "activation": "relu"
            }
          },
          {
            "class_name": "GlobalAveragePooling2D",
            "config": {
              "name": "global_average_pooling2d_1",
              "trainable": true,
              "dtype": "float32"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 4,
              "activation": "sigmoid"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["model.weights.bin"],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [3, 3, 3, 16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [16, 4],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [4],
          "dtype": "float32"
        }
      ]
    }
  ]
}